create_ccopt_clock_tree_spec
get_ccopt_clock_trees *
set_ccopt_property target_max_trans 0.3
set_ccopt_property target_skew 0.2
ccopt_design

