# ####################################################################

#  Created by Genus(TM) Synthesis Solution 17.20-p003_1 on Tue Sep 29 21:38:28 -03 2020

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design uart

create_clock -name "clk" -period 271.26736 -waveform {0.0 135.63368} [get_ports clk16x]
set_load -pin_load -min 0.0014 [get_ports {d_out[7]}]
set_load -pin_load -max 0.32 [get_ports {d_out[7]}]
set_load -pin_load -min 0.0014 [get_ports {d_out[6]}]
set_load -pin_load -max 0.32 [get_ports {d_out[6]}]
set_load -pin_load -min 0.0014 [get_ports {d_out[5]}]
set_load -pin_load -max 0.32 [get_ports {d_out[5]}]
set_load -pin_load -min 0.0014 [get_ports {d_out[4]}]
set_load -pin_load -max 0.32 [get_ports {d_out[4]}]
set_load -pin_load -min 0.0014 [get_ports {d_out[3]}]
set_load -pin_load -max 0.32 [get_ports {d_out[3]}]
set_load -pin_load -min 0.0014 [get_ports {d_out[2]}]
set_load -pin_load -max 0.32 [get_ports {d_out[2]}]
set_load -pin_load -min 0.0014 [get_ports {d_out[1]}]
set_load -pin_load -max 0.32 [get_ports {d_out[1]}]
set_load -pin_load -min 0.0014 [get_ports {d_out[0]}]
set_load -pin_load -max 0.32 [get_ports {d_out[0]}]
set_load -pin_load -min 0.0014 [get_ports r_ready]
set_load -pin_load -max 0.32 [get_ports r_ready]
set_load -pin_load -min 0.0014 [get_ports parity_error]
set_load -pin_load -max 0.32 [get_ports parity_error]
set_load -pin_load -min 0.0014 [get_ports frame_error]
set_load -pin_load -max 0.32 [get_ports frame_error]
set_load -pin_load -min 0.0014 [get_ports t_empty]
set_load -pin_load -max 0.32 [get_ports t_empty]
set_load -pin_load -min 0.0014 [get_ports txd]
set_load -pin_load -max 0.32 [get_ports txd]
set_load -pin_load -min 0.0014 [get_ports {cnt16x[3]}]
set_load -pin_load -max 0.32 [get_ports {cnt16x[3]}]
set_load -pin_load -min 0.0014 [get_ports {cnt16x[2]}]
set_load -pin_load -max 0.32 [get_ports {cnt16x[2]}]
set_load -pin_load -min 0.0014 [get_ports {cnt16x[1]}]
set_load -pin_load -max 0.32 [get_ports {cnt16x[1]}]
set_load -pin_load -min 0.0014 [get_ports {cnt16x[0]}]
set_load -pin_load -max 0.32 [get_ports {cnt16x[0]}]
set_load -pin_load -min 0.0014 [get_ports {no_bits_rcvd[3]}]
set_load -pin_load -max 0.32 [get_ports {no_bits_rcvd[3]}]
set_load -pin_load -min 0.0014 [get_ports {no_bits_rcvd[2]}]
set_load -pin_load -max 0.32 [get_ports {no_bits_rcvd[2]}]
set_load -pin_load -min 0.0014 [get_ports {no_bits_rcvd[1]}]
set_load -pin_load -max 0.32 [get_ports {no_bits_rcvd[1]}]
set_load -pin_load -min 0.0014 [get_ports {no_bits_rcvd[0]}]
set_load -pin_load -max 0.32 [get_ports {no_bits_rcvd[0]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[10]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[10]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[9]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[9]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[8]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[8]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[7]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[7]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[6]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[6]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[5]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[5]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[4]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[4]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[3]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[3]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[2]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[2]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[1]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[1]}]
set_load -pin_load -min 0.0014 [get_ports {r_buffer[0]}]
set_load -pin_load -max 0.32 [get_ports {r_buffer[0]}]
set_load -pin_load -min 0.0014 [get_ports r_clk1x]
set_load -pin_load -max 0.32 [get_ports r_clk1x]
set_load -pin_load -min 0.0014 [get_ports sampling]
set_load -pin_load -max 0.32 [get_ports sampling]
set_load -pin_load -min 0.0014 [get_ports {r_data[7]}]
set_load -pin_load -max 0.32 [get_ports {r_data[7]}]
set_load -pin_load -min 0.0014 [get_ports {r_data[6]}]
set_load -pin_load -max 0.32 [get_ports {r_data[6]}]
set_load -pin_load -min 0.0014 [get_ports {r_data[5]}]
set_load -pin_load -max 0.32 [get_ports {r_data[5]}]
set_load -pin_load -min 0.0014 [get_ports {r_data[4]}]
set_load -pin_load -max 0.32 [get_ports {r_data[4]}]
set_load -pin_load -min 0.0014 [get_ports {r_data[3]}]
set_load -pin_load -max 0.32 [get_ports {r_data[3]}]
set_load -pin_load -min 0.0014 [get_ports {r_data[2]}]
set_load -pin_load -max 0.32 [get_ports {r_data[2]}]
set_load -pin_load -min 0.0014 [get_ports {r_data[1]}]
set_load -pin_load -max 0.32 [get_ports {r_data[1]}]
set_load -pin_load -min 0.0014 [get_ports {r_data[0]}]
set_load -pin_load -max 0.32 [get_ports {r_data[0]}]
set_load -pin_load -min 0.0014 [get_ports {no_bits_sent[3]}]
set_load -pin_load -max 0.32 [get_ports {no_bits_sent[3]}]
set_load -pin_load -min 0.0014 [get_ports {no_bits_sent[2]}]
set_load -pin_load -max 0.32 [get_ports {no_bits_sent[2]}]
set_load -pin_load -min 0.0014 [get_ports {no_bits_sent[1]}]
set_load -pin_load -max 0.32 [get_ports {no_bits_sent[1]}]
set_load -pin_load -min 0.0014 [get_ports {no_bits_sent[0]}]
set_load -pin_load -max 0.32 [get_ports {no_bits_sent[0]}]
set_load -pin_load -min 0.0014 [get_ports {t_buffer[7]}]
set_load -pin_load -max 0.32 [get_ports {t_buffer[7]}]
set_load -pin_load -min 0.0014 [get_ports {t_buffer[6]}]
set_load -pin_load -max 0.32 [get_ports {t_buffer[6]}]
set_load -pin_load -min 0.0014 [get_ports {t_buffer[5]}]
set_load -pin_load -max 0.32 [get_ports {t_buffer[5]}]
set_load -pin_load -min 0.0014 [get_ports {t_buffer[4]}]
set_load -pin_load -max 0.32 [get_ports {t_buffer[4]}]
set_load -pin_load -min 0.0014 [get_ports {t_buffer[3]}]
set_load -pin_load -max 0.32 [get_ports {t_buffer[3]}]
set_load -pin_load -min 0.0014 [get_ports {t_buffer[2]}]
set_load -pin_load -max 0.32 [get_ports {t_buffer[2]}]
set_load -pin_load -min 0.0014 [get_ports {t_buffer[1]}]
set_load -pin_load -max 0.32 [get_ports {t_buffer[1]}]
set_load -pin_load -min 0.0014 [get_ports {t_buffer[0]}]
set_load -pin_load -max 0.32 [get_ports {t_buffer[0]}]
set_load -pin_load -min 0.0014 [get_ports t_clk1x]
set_load -pin_load -max 0.32 [get_ports t_clk1x]
set_load -pin_load -min 0.0014 [get_ports sending]
set_load -pin_load -max 0.32 [get_ports sending]
set_load -pin_load -min 0.0014 [get_ports {t_data[7]}]
set_load -pin_load -max 0.32 [get_ports {t_data[7]}]
set_load -pin_load -min 0.0014 [get_ports {t_data[6]}]
set_load -pin_load -max 0.32 [get_ports {t_data[6]}]
set_load -pin_load -min 0.0014 [get_ports {t_data[5]}]
set_load -pin_load -max 0.32 [get_ports {t_data[5]}]
set_load -pin_load -min 0.0014 [get_ports {t_data[4]}]
set_load -pin_load -max 0.32 [get_ports {t_data[4]}]
set_load -pin_load -min 0.0014 [get_ports {t_data[3]}]
set_load -pin_load -max 0.32 [get_ports {t_data[3]}]
set_load -pin_load -min 0.0014 [get_ports {t_data[2]}]
set_load -pin_load -max 0.32 [get_ports {t_data[2]}]
set_load -pin_load -min 0.0014 [get_ports {t_data[1]}]
set_load -pin_load -max 0.32 [get_ports {t_data[1]}]
set_load -pin_load -min 0.0014 [get_ports {t_data[0]}]
set_load -pin_load -max 0.32 [get_ports {t_data[0]}]
set_false_path -from [get_ports clrn]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -rise -min 0.0 [get_ports clk16x]
set_input_delay -clock [get_clocks clk] -clock_fall -network_latency_included -add_delay -fall -min 0.0 [get_ports clk16x]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports clk16x]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports clrn]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports rdn]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports rxd]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports wrn]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {d_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {d_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {d_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {d_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {d_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {d_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {d_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {d_in[0]}]
set_input_transition -min 0.003 [get_ports clk16x]
set_input_transition -max 0.16 [get_ports clk16x]
set_input_transition -min 0.003 [get_ports clrn]
set_input_transition -max 0.16 [get_ports clrn]
set_input_transition -min 0.003 [get_ports rdn]
set_input_transition -max 0.16 [get_ports rdn]
set_input_transition -min 0.003 [get_ports rxd]
set_input_transition -max 0.16 [get_ports rxd]
set_input_transition -min 0.003 [get_ports wrn]
set_input_transition -max 0.16 [get_ports wrn]
set_input_transition -min 0.003 [get_ports {d_in[7]}]
set_input_transition -max 0.16 [get_ports {d_in[7]}]
set_input_transition -min 0.003 [get_ports {d_in[6]}]
set_input_transition -max 0.16 [get_ports {d_in[6]}]
set_input_transition -min 0.003 [get_ports {d_in[5]}]
set_input_transition -max 0.16 [get_ports {d_in[5]}]
set_input_transition -min 0.003 [get_ports {d_in[4]}]
set_input_transition -max 0.16 [get_ports {d_in[4]}]
set_input_transition -min 0.003 [get_ports {d_in[3]}]
set_input_transition -max 0.16 [get_ports {d_in[3]}]
set_input_transition -min 0.003 [get_ports {d_in[2]}]
set_input_transition -max 0.16 [get_ports {d_in[2]}]
set_input_transition -min 0.003 [get_ports {d_in[1]}]
set_input_transition -max 0.16 [get_ports {d_in[1]}]
set_input_transition -min 0.003 [get_ports {d_in[0]}]
set_input_transition -max 0.16 [get_ports {d_in[0]}]
set_wire_load_selection_group "WireAreaForZero" -library "tcb018gbwp7ttc"
set_dont_use [get_lib_cells tcb018gbwp7ttc/BHDBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GAN2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GAN2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GAOI21D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GAOI21D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GAOI22D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GBUFFD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GBUFFD2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GBUFFD3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GBUFFD8BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDCAP10BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDCAP2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDCAP3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDCAP4BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDCAPBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDFCNQD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDFQD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GFILL10BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GFILL2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GFILL3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GFILL4BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GFILLBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GINVD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GINVD2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GINVD3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GINVD8BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GMUX2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GMUX2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GMUX2ND1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GMUX2ND2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GND2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GND2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GND2D3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GND3D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GND3D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GNR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GNR2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GNR3D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GNR3D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GOAI21D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GOAI21D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GOR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GOR2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GSDFCNQD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GTIEHBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GTIELBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GXNR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GXNR2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GXOR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GXOR2D2BWP7T]
